joristork/robots/jobot_in_c/microchip_extras/h/p18f87k90.h
extern volatile far  unsigned char       ANCON0;
extern volatile far  struct {
  unsigned ANSEL0:1;
  unsigned ANSEL1:1;
  unsigned ANSEL2:1;
  unsigned ANSEL3:1;
  unsigned ANSEL4:1;
  unsigned ANSEL5:1;
  unsigned ANSEL6:1;
  unsigned ANSEL7:1;
} ANCON0bits;
extern volatile far  unsigned char       ODCON3;
extern volatile far  struct {
  unsigned CTMUDS:1;
  unsigned :5;
  unsigned U1OD:1;
  unsigned U2OD:1;
} ODCON3bits;
extern volatile far  unsigned char       ODCON2;
extern volatile far  struct {
  unsigned CCP3OD:1;
  unsigned CCP4OD:1;
  unsigned CCP5OD:1;
  unsigned CCP6OD:1;
  unsigned CCP7OD:1;
  unsigned CCP8OD:1;
  unsigned CCP9OD:1;
  unsigned CCP10OD:1;
} ODCON2bits;
extern volatile far  unsigned char       ODCON1;
extern volatile far  struct {
  unsigned SPI2OD:1;
  unsigned :4;
  unsigned CCP1OD:1;
  unsigned CCP2OD:1;
  unsigned SPI1OD:1;
} ODCON1bits;
extern volatile far  unsigned char       REFOCON;
extern volatile far  union {
  struct {
    unsigned RODIV:4;
    unsigned ROSEL:1;
    unsigned ROSSLP:1;
    unsigned :1;
    unsigned ROON:1;
  };
  struct {
    unsigned RODIV0:1;
    unsigned RODIV1:1;
    unsigned RODIV2:1;
    unsigned RODIV3:1;
  };
} REFOCONbits;
extern volatile far  unsigned char       CCPTMRS2;
extern volatile far  union {
  struct {
    unsigned C8TSEL:2;
    unsigned C9TSEL0:1;
    unsigned :1;
    unsigned C10TSEL0:1;
  };
  struct {
    unsigned C8TSEL0:1;
    unsigned C8TSEL1:1;
  };
} CCPTMRS2bits;
extern volatile far  unsigned char       CCPTMRS1;
extern volatile far  union {
  struct {
    unsigned C4TSEL:2;
    unsigned C5TSEL0:1;
    unsigned :1;
    unsigned C6TSEL0:1;
    unsigned :1;
    unsigned C7TSEL:2;
  };
  struct {
    unsigned C4TSEL0:1;
    unsigned C4TSEL1:1;
    unsigned :4;
    unsigned C7TSEL0:1;
    unsigned C7TSEL1:1;
  };
} CCPTMRS1bits;
extern volatile far  unsigned char       CCPTMRS0;
extern volatile far  union {
  struct {
    unsigned C1TSEL:3;
    unsigned C2TSEL:3;
    unsigned C3TSEL:2;
  };
  struct {
    unsigned C1TSEL0:1;
    unsigned C1TSEL1:1;
    unsigned C1TSEL2:1;
    unsigned C2TSEL0:1;
    unsigned C2TSEL1:1;
    unsigned C2TSEL2:1;
    unsigned C3TSEL0:1;
    unsigned C3TSEL1:1;
  };
} CCPTMRS0bits;
extern volatile far  unsigned char       CM3CON;
extern volatile far  union {
  struct {
    unsigned CCH:2;
    unsigned CREF:1;
    unsigned EVPOL:2;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned CON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :1;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
} CM3CONbits;
extern volatile far  unsigned char       CM3CON1;
extern volatile far  union {
  struct {
    unsigned CCH:2;
    unsigned CREF:1;
    unsigned EVPOL:2;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned CON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :1;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
} CM3CON1bits;
extern volatile far  unsigned char       CM2CON;
extern volatile far  union {
  struct {
    unsigned CCH:2;
    unsigned CREF:1;
    unsigned EVPOL:2;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned CON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :1;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
} CM2CONbits;
extern volatile far  unsigned char       CM2CON1;
extern volatile far  union {
  struct {
    unsigned CCH:2;
    unsigned CREF:1;
    unsigned EVPOL:2;
    unsigned CPOL:1;
    unsigned COE:1;
    unsigned CON:1;
  };
  struct {
    unsigned CCH0:1;
    unsigned CCH1:1;
    unsigned :1;
    unsigned EVPOL0:1;
    unsigned EVPOL1:1;
  };
} CM2CON1bits;
extern volatile far  unsigned char       T12CON;
extern volatile far  union {
  struct {
    unsigned T12CKPS:2;
    unsigned TMR12ON:1;
    unsigned T12OUTPS:4;
  };
  struct {
    unsigned T12CKPS0:1;
    unsigned T12CKPS1:1;
    unsigned :1;
    unsigned T12OUTPS0:1;
    unsigned T12OUTPS1:1;
    unsigned T12OUTPS2:1;
    unsigned T12OUTPS3:1;
  };
} T12CONbits;
extern volatile far  unsigned char       PR12;
extern volatile far  unsigned char       TMR12;
extern volatile far  unsigned char       T10CON;
extern volatile far  union {
  struct {
    unsigned T10CKPS:2;
    unsigned TMR10ON:1;
    unsigned T10OUTPS:4;
  };
  struct {
    unsigned T10CKPS0:1;
    unsigned T10CKPS1:1;
    unsigned :1;
    unsigned T10OUTPS0:1;
    unsigned T10OUTPS1:1;
    unsigned T10OUTPS2:1;
    unsigned T10OUTPS3:1;
  };
} T10CONbits;
extern volatile far  unsigned char       PR10;
extern volatile far  unsigned char       TMR10;
extern volatile far  unsigned char       T8CON;
extern volatile far  union {
  struct {
    unsigned T8CKPS:2;
    unsigned TMR8ON:1;
    unsigned T8OUTPS:4;
  };
  struct {
    unsigned T8CKPS0:1;
    unsigned T8CKPS1:1;
    unsigned :1;
    unsigned T8OUTPS0:1;
    unsigned T8OUTPS1:1;
    unsigned T8OUTPS2:1;
    unsigned T8OUTPS3:1;
  };
} T8CONbits;
extern volatile far  unsigned char       PR8;
extern volatile far  unsigned char       TMR8;
extern volatile far  unsigned char       T6CON;
extern volatile far  union {
  struct {
    unsigned T6CKPS:2;
    unsigned TMR6ON:1;
    unsigned T6OUTPS:4;
  };
  struct {
    unsigned T6CKPS0:1;
    unsigned T6CKPS1:1;
    unsigned :1;
    unsigned T6OUTPS0:1;
    unsigned T6OUTPS1:1;
    unsigned T6OUTPS2:1;
    unsigned T6OUTPS3:1;
  };
} T6CONbits;
extern volatile far  unsigned char       PR6;
extern volatile far  unsigned char       TMR6;
extern volatile far  unsigned char       T7GCON;
extern volatile far  union {
  struct {
    unsigned T7GSS:2;
    unsigned T7GVAL:1;
    unsigned T7GGO_NOT_T7DONE:1;
    unsigned T7GSPM:1;
    unsigned T7GTM:1;
    unsigned T7GPOL:1;
    unsigned TMR7GE:1;
  };
  struct {
    unsigned T7GSS0:1;
    unsigned T7GSS1:1;
    unsigned :1;
    unsigned T7GGO:1;
  };
  struct {
    unsigned :3;
    unsigned NOT_T7DONE:1;
  };
} T7GCONbits;
extern volatile far  unsigned char       T7CON;
extern volatile far  union {
  struct {
    unsigned TMR7ON:1;
    unsigned RD16:1;
    unsigned NOT_T7SYNC:1;
    unsigned SOSCEN:1;
    unsigned T7CKPS:2;
    unsigned TMR7CS:2;
  };
  struct {
    unsigned :4;
    unsigned T7CKPS0:1;
    unsigned T7CKPS1:1;
    unsigned TMR7CS0:1;
    unsigned TMR7CS1:1;
  };
} T7CONbits;
extern volatile far  unsigned char       TMR7L;
extern volatile far  union {
  struct {
    unsigned TMR7L:8;
  };
  struct {
    unsigned CAL0:1;
    unsigned CAL1:1;
    unsigned CAL2:1;
    unsigned CAL3:1;
    unsigned CAL4:1;
    unsigned CAL5:1;
    unsigned CAL6:1;
    unsigned CAL7:1;
  };
} TMR7Lbits;
extern volatile far  unsigned char       TMR7H;
extern volatile far  unsigned char       CCP10CON;
extern volatile far  union {
  struct {
    unsigned CCP10M:4;
    unsigned DC10B:2;
  };
  struct {
    unsigned CCP10M0:1;
    unsigned CCP10M1:1;
    unsigned CCP10M2:1;
    unsigned CCP10M3:1;
    unsigned DC10B0:1;
    unsigned DC10B1:1;
  };
  struct {
    unsigned :4;
    unsigned CCP10Y:1;
    unsigned CCP10X:1;
  };
} CCP10CONbits;
